config/gptel/presets/system-explorer/preset.org
#+title: Preset: system-explorer
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle preset.el
#+auto_tangle: y

* Introduction

The =system-explorer= preset is a *read-only environment analyst*. Its job is to
understand a machine and its projects — installed packages, available commands,
configuration, and current state — and to reason carefully about that evidence
when troubleshooting. It performs *no* writes, edits, deletions, or
deny-violating operations.

This =.org= source carries two things (design.md Decision 6):

1. A *role fragment* — the static system prompt describing /how to reason about/
   environments. It deliberately bakes in *no live machine data*: capturing
   actual machine state is the dynamic =environment= fragment's job (and the
   tools'), not the static role (design.md Non-Goals; static/dynamic
   separation).
2. An *Elisp config block* — native-typed preset keys (=:backend=, =:model=,
   =:temperature=, =:description=, a read-only =:tools= set, and a read-only
   =:scope-profile=). No write/modify/deny-violating capabilities are granted.

Tangling produces =preset.el=. When loaded, =preset.el= renders its role
fragment for the =claude= backend via [[file:../fragments.org][=jf/gptel-fragment-render=]] and registers
the preset through [[file:../registration.org][=jf/gptel-preset-register=]] with =:system= set to the rendered
role text. The render happens once at load time (not per send), so the static
system prompt is a stable, cacheable prefix
(register/invariant/static-prerender-dynamic-compose).

* Lexical Binding

#+begin_src emacs-lisp :comments no
;;; preset.el --- system-explorer preset (read-only environment analyst) -*- lexical-binding: t; -*-

;; Copyright (C) 2026 Jeff Farr

;; Author: Jeff Farr
;; Keywords: gptel, llm, presets

;;; Commentary:

;; The `system-explorer' preset: a read-only environment analyst.  This file is
;; tangled from preset.org -- edit the .org, never this .el.  On load it renders
;; its static role fragment for the `claude' backend and registers the preset via
;; `jf/gptel-preset-register' with a pre-rendered :system.  It grants only
;; read-only tools and a read-only scope profile -- no write/modify/deny ops.

;;; Code:
#+end_src

* Dependencies

The renderer and the registration entry point are loaded ahead of presets by the
gptel load order; we =require= them defensively (by path) so this preset also
loads cleanly in isolation (batch specs, ad-hoc =load=).

#+begin_src emacs-lisp
(require 'cl-lib)
(require 'subr-x)

(let ((presets-dir
       (file-name-directory
        (directory-file-name
         (file-name-directory (or load-file-name buffer-file-name))))))
  (require 'jf-gptel-fragments
           (expand-file-name "fragments.el" presets-dir))
  (require 'gptel-preset-registration
           (expand-file-name "registration.el" presets-dir)))
#+end_src

* Role fragment

The static role prompt, authored as a fragment plist =(:kind static :sections
((NAME . BODY) ...))= — the exact shape =jf/gptel-fragment--parse-source= emits.
We build the sections directly in Elisp rather than embedding an Org string with
column-0 =*= headings (those collide with Org's own tangler/heading syntax);
either way the renderer (=jf/gptel-fragment-render=) remains the single source of
truth for the emitted Claude format (each section → =<tag>body</tag>=, blank-line
joined).

The content is intentionally machine-agnostic: it describes /how to reason
about/ an environment (analyze before concluding, prefer primary evidence, stay
read-only). It never asserts what is installed or how the machine is configured
— that is discovered live, through tools and the dynamic environment fragment.

#+begin_src emacs-lisp
(defconst jf/gptel-preset-system-explorer--role-fragment
  '(:kind static
    :sections
    (("Role" .
      "You are a read-only environment analyst. You investigate machines and the\nprojects on them — installed packages and their versions, available commands and\nwhere they live, configuration files, runtimes, and current system state — and\nyou reason carefully from that evidence to answer questions and troubleshoot\nproblems. You observe and explain; you never change anything.")
     ("Background" .
      "Environments differ: operating system, package managers, shells, language\nruntimes, and project layout all vary from machine to machine. You therefore\ntreat every claim about \"what is on this machine\" as something to be\ndiscovered, not assumed. Authoritative evidence comes from inspecting the system\ndirectly — reading files, listing directories, searching the project, and\nexamining declared dependencies (lockfiles, manifests, version output) — rather\nthan from prior belief about how a system is \"usually\" set up. You do not carry\na baked-in snapshot of any machine's state; current state is supplied to you at\nrun time.")
     ("Instructions" .
      "1. Restate the question as a concrete thing to find out about the environment\n   (a version, a path, a configuration value, the cause of a failure).\n2. Gather evidence read-only: read files, list directories, and search the\n   project. Start broad to orient, then narrow to the specific artifact.\n3. Prefer primary evidence (a lockfile, a manifest, command-version output, an\n   actual config file) over inference or recollection. Cite the source of each\n   fact you report.\n4. Analyze before you conclude: cross-check findings, note when evidence is\n   missing or ambiguous, and distinguish what you observed from what you infer.\n5. Report findings plainly — what is installed/configured, where it lives, and\n   (for troubleshooting) the most likely cause with the evidence behind it.\n6. When the evidence is insufficient to answer confidently, say so and name the\n   read-only check that would resolve it, rather than guessing.")
     ("Constraints" .
      "You are strictly read-only. You must not create, edit, move, rename, or delete\nfiles; not install, upgrade, or remove packages; not change configuration; not\nstart, stop, or signal processes; and not perform any privileged or\ndeny-violating operation. Do not authenticate to cloud or remote services. If a\ntask would require any modification, do not attempt it — explain that this is a\nread-only analyst and describe what a write-capable preset would need to do.\nReiterating: observe and explain only; never alter the system.")))
  "Static role fragment for the system-explorer preset.
A fragment plist (:kind static :sections ((NAME . BODY) ...)) — the shape
`jf/gptel-fragment--parse-source' produces — rendered at load time by
`jf/gptel-fragment-render'.")
#+end_src

* Render the role at load time

Render the role fragment once for the =claude= backend.  This is a load-time
pre-render (not per-send), so the resulting =:system= is a stable cacheable
prefix.  The rendered string is what the golden snapshot asserts against.

#+begin_src emacs-lisp
(defconst jf/gptel-preset-system-explorer--system
  (jf/gptel-fragment-render
   jf/gptel-preset-system-explorer--role-fragment
   'claude)
  "Pre-rendered Claude system prompt for the system-explorer preset.")
#+end_src

* Register the preset

Native-Elisp config block.  Read-only by construction:

- =:tools= names only read-only tools (=read_file=, =list_directory=,
  =search_project_content=, =list_project_files=) — none can write, modify, or
  delete.
- =:scope-profile= is the committed read-only =system-explorer= profile (no write
  / modify / execute paths; cloud auth denied). Registration extracts it into
  =jf/gptel-preset--scope-defaults=; it never reaches =gptel-make-preset=.
- No =:paths=, =:shell-commands=, or =:bash-tools= keys are supplied, so no
  ad-hoc write/exec capability is granted at the preset level.

#+begin_src emacs-lisp
(jf/gptel-preset-register
 'system-explorer
 :description "Read-only environment analyst: inspect installed packages, available commands, configuration, and system state to answer questions and troubleshoot — never modifies anything."
 :backend 'claude
 :model 'claude-sonnet-4-6
 :temperature 0.3
 :tools '("read_file" "list_directory" "search_project_content" "list_project_files")
 :scope-profile "system-explorer"
 :system jf/gptel-preset-system-explorer--system)
#+end_src

* Footer

#+begin_src emacs-lisp :comments no
(provide 'gptel-preset-system-explorer)
;;; preset.el ends here
#+end_src
